
//############################################################################################################################################
//cocoguojia 封装2023.4.11
//功能说明
//
//############################################################################################################################################

////////////////////////////////////////////////////////////////////////
//本地.h文件
#include "eMBPollTask.h"
#include "mb.h"

//////////////////////////////////////////////////////////////////////////////////////////
//任务句柄
osThreadId_t eMBPollTask_NHandle;
//////////////////////////////////////////////////////////////////////////////////////////
//任务属性
const osThreadAttr_t eMBPollTask_N_attributes = {
  .name = "eMBPollTask_N",
  .stack_size = EMBPOLLTASK_stack_size,
  .priority = (osPriority_t) EMBPOLLTASK_Priority,
};



//////////////////////////////////////////////////////////////////////////////////////////
//任务
void eMBPollTask(void *argument)
{
    osDelay(20);
    //------------------------------------------------------------------------------------------
    //modbus模块函数
    //放在初始化里，注意eMBTCPInit的形式参数502没有意义，端口号由具体的网络wifi模块初始化决定
    eMBTCPInit( 502 );     // modbus TCP初始化     来自modbus模块mb.c文件 
    eMBEnable();	       // modbus 协议使能函数   来自modbus模块mb.c文件 
    for(;;)
    {
        eMBPoll();         //放在大循环里，处理modbus 来自modbus模块mb.c文件   
        osDelay(10);
    }
}
