
//############################################################################################################################################
//cocoguojia 封装2023.3.1
//功能说明
//检测5路按钮按下时间,为了保证实时性，用了扫描计数法，5路串联快扫，精度粗记为10ms
//############################################################################################################################################

////////////////////////////////////////////////////////////////////////
//本地.h文件
#include "KeyTimerTask.h"

////////////////////////////////////////////////////////////////////////
//任务句柄
osThreadId_t KeyTimerTask_NHandle;
////////////////////////////////////////////////////////////////////////
//任务属性
const osThreadAttr_t KeyTimerTask_N_attributes = {
  .name = "KeyTimerTask_N",
  .stack_size = EKYTIMERTASK_stack_size,
  .priority = (osPriority_t) EKYTIMERTASK_Priority,
};


////////////////////////////////////////////////////////////////////////
//任务
void KeyTimerTask(void *argument)
{

  uint8_t i=0;
  uint8_t keyTimerTable10ms[6]={0,0,0,0,0,0};//按钮小累计时长统计寄存器 以10ms为单位 每100次即1s为统计周期 函数 内部使用 [0]无意义

  for(;;)
  {
     //------------------------------------------------------------------------------
     //依次扫描5个按钮 当前状态如果是被按下则统计时长 以10ms的精度统计 准确
     for(i=1;i<=5;i++)
     {
        if(1==g_keyStateTalbe[i])
        {
            keyTimerTable10ms[i]++;
            if(100<=keyTimerTable10ms[i])
            {
                keyTimerTable10ms[i]=0;
                g_keyTimeTalbe[i]++;
                
                //##############################################################################################
                //互斥操作
                osMutexAcquire(ReadWriteRegHoldingMutexHandle, osWaitForever);   //一直等待获取互斥资源 
                usRegHoldingBuf[7+i]=g_keyTimeTalbe[i];
                osMutexRelease(ReadWriteRegHoldingMutexHandle);                  //释放互斥资源    
                //##############################################################################################
            }
        }
     }
     osDelay(10);//10ms的时间累积精度
  }
}

